codelingo/troubleshooting/tenets/flags-have-underscores.org
#+TITLE: troubleshooting new tenet ~flags-have-underscores~
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://mullikine.github.io/org-main.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://mullikine.github.io/magit.css"/>

* Problem
Lexicon error. Transport closing.

** ~example.go~
#+BEGIN_SRC go
  // ./example.go
  package main
  
  import (
      "github.com/spf13/pflag"
  )
  
  type ConfigFlags struct {
      CertFile         *string
  }
  
  const (
      flagGoodName      = "good-name"
      flagBadName     = "bad_name"
  )
  
  func (f *ConfigFlags) AddFlags(flags *pflag.FlagSet) {
      flags.StringVar(f.CertFile, flagGoodName, *f.CertFile, "This is the discription of a good flag")
      flags.StringVar(f.CertFile, flagBadName, *f.CertFile, "This is the discription of a bad flag")
  }
  
#+END_SRC

** This ~codelingo.yaml~ fails
#+BEGIN_SRC yaml
  funcs:
    - name: contains
      type: asserter
      body: |
        function (str, substr) {
          return str.indexOf(substr) != -1
        }
  
  tenets:
    - name: flags-have-underscores
      flows:
        codelingo/docs:
          title: Flags Have Underscores
          body: |
            Command-line flags should use dashes, not underscores. See "https://github.com/kubernetes/community/blob/master/contributors/guide/coding-conventions.md"
        codelingo/review:
          comment: Flag `{{flagname}}` contains an underscore. Use a dash instead.
      query: |
        import codelingo/ast/go
        
        go.file(depth = any):
          go.decls:
            go.import_spec(depth = 1):
              go.basic_lit:
                value == "github.com/spf13/pflag"
            go.func_decl:
              go.func_type:
                go.field_list:
                  go.field:
                    go.names:
                      go.ident:
                        name as paraname
                    go.star_expr:
                      go.selector_expr:
                        go.ident:
                          name == "pflag"
                        go.ident:
                          name == "FlagSet"
              go.call_expr(depth = 3):
                go.selector_expr:
                  go.ident:
                    name == paraname
                  go.ident:
                    name == "StringVar"
                go.args:
                  @review comment
                  go.ident:
                    value as flagname
                    contains(flagname, "_")
#+END_SRC

** annotated ~tty-output.log~
#+BEGIN_SRC text
  Constructing new git repo in temp folder... :: Thu Nov  1 13:43:47 NZDT 2018
  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
  Running: $HOME/scripts/rs -nc
          -nogit
          -noswap
          $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/flags-have-underscores/
          /tmp/td_flags-have-underscoreseIK9Zp
  /usr/bin/rsync  -a -rtlhx -pug -s  --inplace --append   --exclude .cache  --exclude .git/ --exclude .gitignore --exclude TODO  --exclude '*~' --exclude '.#*'  $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/flags-have-underscores/ /tmp/td_flags-have-underscoreseIK9Zp
  ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
  /tmp/td_flags-have-underscoreseIK9Zp
  working_dir (initial): /tmp/td_flags-have-underscoreseIK9Zp
  Syncing your repo...
  Running review flow...
  Sorry, an error occurred while processing your request. Please try again.
  <Check slack error>
  exit status 1
  review finished
  Reformulate?
  working_dir (loop): /tmp/td_flags-have-underscoreseIK9Zp
  : B
  working_dir: /tmp/td_flags-have-underscoreseIK9Zp
  Continue?
#+END_SRC

** repository info
| tenet source                                                           |
|------------------------------------------------------------------------|
| [[https://github.com/mullikine/tenets/blob/master/blog/flags-have-underscores][tenets/blog/flags-have-underscores at master  mullikine/tenets  GitHub]] |

| org                                                                                                              |
|------------------------------------------------------------------------------------------------------------------|
| [[https://github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/flags-have-underscores.org][github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/flags-have-underscores.org]] |

** https://github.com/codelingo/codelingo/blob/master
| command        | value                                    |
|----------------+------------------------------------------|
| cat /etc/issue | Ubuntu 16.04.4 LTS \n \l                 |
| vc url         | https://github.com/codelingo/codelingo   |
| vc get-hash    | eae3300ad7c32994725f90344f7cc25edfee6eca |
| vc branch      | master                                   |
| go version     | go version go1.11.1 linux/amd64          |

#+BEGIN_SRC text
commit eae3300ad7c32994725f90344f7cc25edfee6eca
Author: Jesse Meek <waigani@gmail.com>
Date:   Sat Oct 27 10:37:36 2018 +1300

    Disable test Tenet until mem spike is fixed.
#+END_SRC

** git@github.com:mullikine/lingo.git/blob/master
| command        | value                                    |
|----------------+------------------------------------------|
| cat /etc/issue | Ubuntu 16.04.4 LTS \n \l                 |
| vc url         | git@github.com:mullikine/lingo.git       |
| vc get-hash    | fa9b4edd1dcad69f83892282d69877ab51f4e89c |
| vc branch      | master                                   |
| go version     | go version go1.11.1 linux/amd64          |

#+BEGIN_SRC text
commit fa9b4edd1dcad69f83892282d69877ab51f4e89c
Merge: f34abad d1910ac
Author: BlakeMScurr <blake@codelingo.io>
Date:   Wed Oct 17 17:45:51 2018 +1300

    Merge pull request #424 from BlakeMScurr/docs-update
    
    Update doc fields.
#+END_SRC
