codelingo/troubleshooting/tenets/flags-have-underscores.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-11-02 Fri 19:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>troubleshooting new tenet <code>flags-have-underscores</code></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="shane" />
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/org-main.css"/>
<link rel="stylesheet" type="text/css" href="https://mullikine.github.io/magit.css"/>
</head>
<body>
<div id="content">
<h1 class="title">troubleshooting new tenet <code>flags-have-underscores</code></h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org712e6bc">1. Problem</a>
<ul>
<li><a href="#org28897ad">1.1. <code>example.go</code></a></li>
<li><a href="#orgecb69ce">1.2. This <code>codelingo.yaml</code> fails</a></li>
<li><a href="#orga85b2aa">1.3. annotated <code>tty-output.log</code></a></li>
<li><a href="#orgdc01cf3">1.4. repository info</a></li>
<li><a href="#org048812b">1.5. https://github.com/codelingo/codelingo/blob/master</a></li>
<li><a href="#org434aed4">1.6. git@github.com:mullikine/lingo.git/blob/master</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org712e6bc" class="outline-2">
<h2 id="org712e6bc"><span class="section-number-2">1</span> Problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Lexicon error. Transport closing.
</p>
</div>

<div id="outline-container-org28897ad" class="outline-3">
<h3 id="org28897ad"><span class="section-number-3">1.1</span> <code>example.go</code></h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">./example.go</span>
<span style="color: #a1db00;">package</span> main

<span style="color: #a1db00;">import</span> (
    <span style="color: #ff4ea3;">"github.com/spf13/pflag"</span>
)

<span style="color: #a1db00;">type</span> <span style="color: #00d7af;">ConfigFlags</span> <span style="color: #a1db00;">struct</span> {
    CertFile         *string
}

<span style="color: #a1db00;">const</span> (
    flagGoodName      = <span style="color: #ff4ea3;">"good-name"</span>
    flagBadName     = <span style="color: #ff4ea3;">"bad_name"</span>
)

<span style="color: #a1db00;">func</span> (f *<span style="color: #00d7af;">ConfigFlags</span>) <span style="color: #ffd700;">AddFlags</span>(flags *<span style="color: #00d7af;">pflag.FlagSet</span>) {
    flags.<span style="color: #ffd700;">StringVar</span>(f.CertFile, flagGoodName, *f.CertFile, <span style="color: #ff4ea3;">"This is the discription of a good flag"</span>)
    flags.<span style="color: #ffd700;">StringVar</span>(f.CertFile, flagBadName, *f.CertFile, <span style="color: #ff4ea3;">"This is the discription of a bad flag"</span>)
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgecb69ce" class="outline-3">
<h3 id="orgecb69ce"><span class="section-number-3">1.2</span> This <code>codelingo.yaml</code> fails</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #ff8700;">funcs</span>:
  - <span style="color: #ff8700;">name</span>: contains
    <span style="color: #ff8700;">type</span>: asserter
    <span style="color: #ff8700;">body</span>: |
      <span style="color: #ff4ea3;">function (str, substr) {</span>
<span style="color: #ff4ea3;">        return str.indexOf(substr) != -1</span>
<span style="color: #ff4ea3;">      }</span>

<span style="color: #ff8700;">tenets</span>:
  - <span style="color: #ff8700;">name</span>: flags-have-underscores
    <span style="color: #ff8700;">flows</span>:
      <span style="color: #ff8700;">codelingo/docs</span>:
        <span style="color: #ff8700;">title</span>: Flags Have Underscores
        <span style="color: #ff8700;">body</span>: |
          Command-line flags should use dashes, not underscores. See <span style="color: #ff4ea3;">"https://github.com/kubernetes/community/blob/master/contributors/guide/coding-conventions.md"</span>
      <span style="color: #ff8700;">codelingo/review</span>:
        <span style="color: #ff8700;">comment</span>: Flag `{{flagname}}` contains an underscore. Use a dash instead.
    <span style="color: #ff8700;">query</span>: |
      <span style="color: #ff4ea3;">import codelingo/ast/go</span>

<span style="color: #ff4ea3;">      go.file(depth = any):</span>
<span style="color: #ff4ea3;">        go.decls:</span>
<span style="color: #ff4ea3;">          go.import_spec(depth = 1):</span>
<span style="color: #ff4ea3;">            go.basic_lit:</span>
              value == <span style="color: #ff4ea3;">"github.com/spf13/pflag"</span>
<span style="color: #ff4ea3;">          go.func_decl:</span>
<span style="color: #ff4ea3;">            go.func_type:</span>
<span style="color: #ff4ea3;">              go.field_list:</span>
<span style="color: #ff4ea3;">                go.field:</span>
<span style="color: #ff4ea3;">                  go.names:</span>
<span style="color: #ff4ea3;">                    go.ident:</span>
<span style="color: #ff4ea3;">                      name as paraname</span>
<span style="color: #ff4ea3;">                  go.star_expr:</span>
<span style="color: #ff4ea3;">                    go.selector_expr:</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"pflag"</span>
<span style="color: #ff4ea3;">                      go.ident:</span>
                        name == <span style="color: #ff4ea3;">"FlagSet"</span>
<span style="color: #ff4ea3;">            go.call_expr(depth = 3):</span>
<span style="color: #ff4ea3;">              go.selector_expr:</span>
<span style="color: #ff4ea3;">                go.ident:</span>
<span style="color: #ff4ea3;">                  name == paraname</span>
<span style="color: #ff4ea3;">                go.ident:</span>
                  name == <span style="color: #ff4ea3;">"StringVar"</span>
<span style="color: #ff4ea3;">              go.args:</span>
<span style="color: #ff4ea3;">                @review comment</span>
<span style="color: #ff4ea3;">                go.ident:</span>
<span style="color: #ff4ea3;">                  value as flagname</span>
                  contains(flagname, <span style="color: #ff4ea3;">"_"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga85b2aa" class="outline-3">
<h3 id="orga85b2aa"><span class="section-number-3">1.3</span> annotated <code>tty-output.log</code></h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-text">Constructing new git repo in temp folder... :: Thu Nov  1 13:43:47 NZDT 2018
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
Running: $HOME/scripts/rs -nc
        -nogit
        -noswap
        $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/flags-have-underscores/
        /tmp/td_flags-have-underscoreseIK9Zp
/usr/bin/rsync  -a -rtlhx -pug -s  --inplace --append   --exclude .cache  --exclude .git/ --exclude .gitignore --exclude TODO  --exclude '*~' --exclude '.#*'  $HOME/source/git/mullikine/codelingo/tenets/codelingo/k8/flags-have-underscores/ /tmp/td_flags-have-underscoreseIK9Zp
&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;&#8254;
/tmp/td_flags-have-underscoreseIK9Zp
working_dir (initial): /tmp/td_flags-have-underscoreseIK9Zp
Syncing your repo...
Running review flow...
Sorry, an <span style="color: #ffff00; background-color: #cccc00;">error</span> occurred while processing your request. Please try again.
&lt;Check slack <span style="color: #ffff00; background-color: #cccc00;">error</span>&gt;
exit status 1
review finished
Reformulate?
working_dir (loop): /tmp/td_flags-have-underscoreseIK9Zp
: B
working_dir: /tmp/td_flags-have-underscoreseIK9Zp
Continue?
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc01cf3" class="outline-3">
<h3 id="orgdc01cf3"><span class="section-number-3">1.4</span> repository info</h3>
<div class="outline-text-3" id="text-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">tenet source</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/tenets/blob/master/blog/flags-have-underscores">tenets/blog/flags-have-underscores at master  mullikine/tenets  GitHub</a></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">org</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/flags-have-underscores.org">github.com/mullikine/mullikine.github.io/blob/master/codelingo/troubleshooting/tenets/flags-have-underscores.org</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org048812b" class="outline-3">
<h3 id="org048812b"><span class="section-number-3">1.5</span> <a href="https://github.com/codelingo/codelingo/blob/master">https://github.com/codelingo/codelingo/blob/master</a></h3>
<div class="outline-text-3" id="text-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left"><a href="https://github.com/codelingo/codelingo">https://github.com/codelingo/codelingo</a></td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">eae3300ad7c32994725f90344f7cc25edfee6eca</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit eae3300ad7c32994725f90344f7cc25edfee6eca
Author: Jesse Meek <a href="mailto:waigani%40gmail.com">&lt;waigani@gmail.com&gt;</a>
Date:   Sat Oct 27 10:37:36 2018 +1300

    Disable test Tenet until mem spike is fixed.
</pre>
</div>
</div>
</div>

<div id="outline-container-org434aed4" class="outline-3">
<h3 id="org434aed4"><span class="section-number-3">1.6</span> git@github.com:mullikine/lingo.git/blob/master</h3>
<div class="outline-text-3" id="text-1-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">command</th>
<th scope="col" class="org-left">value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cat /etc/issue</td>
<td class="org-left">Ubuntu 16.04.4 LTS \n \l</td>
</tr>

<tr>
<td class="org-left">vc url</td>
<td class="org-left">git@github.com:mullikine/lingo.git</td>
</tr>

<tr>
<td class="org-left">vc get-hash</td>
<td class="org-left">fa9b4edd1dcad69f83892282d69877ab51f4e89c</td>
</tr>

<tr>
<td class="org-left">vc branch</td>
<td class="org-left">master</td>
</tr>

<tr>
<td class="org-left">go version</td>
<td class="org-left">go version go1.11.1 linux/amd64</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-text">commit fa9b4edd1dcad69f83892282d69877ab51f4e89c
Merge: f34abad d1910ac
Author: BlakeMScurr <a href="mailto:blake%40codelingo.io">&lt;blake@codelingo.io&gt;</a>
Date:   Wed Oct 17 17:45:51 2018 +1300

    Merge pull request #424 from BlakeMScurr/docs-update
    
    Update doc fields.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: shane</p>
<p class="date">Created: 2018-11-02 Fri 19:58</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>